/*
*********************************************************************************************************
*
*	模块名称 : SPI接口串行FLASH 读写模块
*	文件名称 : bsp_spi_flash.c
*	版    本 : V1.0
*	说    明 : SPI Flash读写
*			   			  
*	修改记录 :
*		版本号  日期         作者      说明
*		V1.0    2022-05-29  Eric203    正式发布
*
*	Copyright (C), 2020-2030, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/
#include "bsp.h"


static void sf_WriteEnable(void);
static void sf_WaitForWriteEnd(void);

/*
*********************************************************************************************************
*	函 数 名: sf_SetCS
*	功能说明: 串行FALSH片选控制函数
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void sf_SetCS(uint8_t _Level)
{
//	if (_Level == 0)
//	{	
//		SF_CS_0();
//	}
//	else
//	{		
//		SF_CS_1();	
//	}
}

/*
*********************************************************************************************************
*	函 数 名: sf_EraseSector
*	功能说明: 擦除指定的扇区
*	形    参: _uiSectorAddr : 扇区地址
*	返 回 值: 无
*********************************************************************************************************
*/
void sf_EraseSector(uint32_t _uiSectorAddr)
{
//	sf_WriteEnable();								/* 发送写使能命令 */

//	/* 擦除扇区操作 */
//	sf_SetCS(0);										/* 使能片选 */
//	bsp_spiWrite0(CMD_SE);								/* 发送擦除命令 */
//	bsp_spiWrite0((_uiSectorAddr & 0xFF0000) >> 16);	/* 发送扇区地址的高8bit */
//	bsp_spiWrite0((_uiSectorAddr & 0xFF00) >> 8);		/* 发送扇区地址中间8bit */
//	bsp_spiWrite0(_uiSectorAddr & 0xFF);				/* 发送扇区地址低8bit */
//	sf_SetCS(1);									/* 禁能片选 */

//	sf_WaitForWriteEnd();							/* 等待串行Flash内部写操作完成 */
		QSPI_Erase(QSPI0, QSPI_CMD_ERASE_SECTOR, _uiSectorAddr, 1);
}

/*
*********************************************************************************************************
*	函 数 名: sf_EraseChip
*	功能说明: 擦除整个芯片
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void sf_EraseChip(void)
{	
//	sf_WriteEnable();								/* 发送写使能命令 */

//	/* 擦除扇区操作 */
//	sf_SetCS(0);		/* 使能片选 */
//	bsp_spiWrite0(CMD_BE);							/* 发送整片擦除命令 */
//	sf_SetCS(1);									/* 禁能片选 */

//	sf_WaitForWriteEnd();							/* 等待串行Flash内部写操作完成 */
}

/*
*********************************************************************************************************
*	函 数 名: sf_PageWrite
*	功能说明: 页编程。
*	形    参: _pBuf : 数据源缓冲区。
*			  _uiWriteAddr ：目标区域首地址。
*			  _usSize ：数据个数，小于等于页大小（256字节）
*	返 回 值: 无
*********************************************************************************************************
*/
void sf_PageWrite(uint8_t * _pBuf, uint32_t _uiWriteAddr, uint16_t _usSize)
{
	QSPI_Write_4bit(QSPI0, _uiWriteAddr, _pBuf, _usSize);
}

/*
*********************************************************************************************************
*	函 数 名: sf_ReadBuffer
*	功能说明: 连续读取若干字节，字节个数不能超出芯片容量。
*	形    参:  	_pBuf : 数据源缓冲区；
*				_uiReadAddr ：首地址
*				_usSize ：数据个数, 不能超出芯片总容量
*	返 回 值: 无
*********************************************************************************************************
*/
void sf_ReadBuffer(uint8_t * _pBuf, uint32_t _uiReadAddr, uint32_t _uiSize)
{
	qspi_dma_read(_uiReadAddr, _pBuf, _uiSize, 4, 4);
}

/*
*********************************************************************************************************
*	函 数 名: sf_WriteEnable
*	功能说明: 向器件发送写使能命令
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void sf_WriteEnable(void)
{
//	sf_SetCS(0);									/* 使能片选 */
//	bsp_spiWrite0(CMD_WREN);								/* 发送命令 */
//	sf_SetCS(1);									/* 禁能片选 */
}

/*
*********************************************************************************************************
*	函 数 名: sf_WaitForWriteEnd
*	功能说明: 采用循环查询的方式等待器件内部写操作完成
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
static void sf_WaitForWriteEnd(void)
{
//	sf_SetCS(0);									/* 使能片选 */
//	bsp_spiWrite0(CMD_RDSR);							/* 发送命令， 读状态寄存器 */
//	while((bsp_spiRead0() & WIP_FLAG) == SET);	/* 判断状态寄存器的忙标志位 */
//	sf_SetCS(1);									/* 禁能片选 */
}

/***************************** 安富莱电子 www.armfly.com (END OF FILE) *********************************/
